/******************************************************************************
* File Name          : template.h
* Description        : Code for xxxxxxxxxxx
 ------------------------------------------------------------------------------
* (c) This software is the proprietary of Bull. All rights are reserved by Bull.
-------------------------------------------------------------------------------
*             R E V I S I O N   H I S T O R Y
-------------------------------------------------------------------------------
* Date          Version      Author    Description
------------    --------     -------   ----------------------------------------
*2025/10/10      V1.0.0      chenls    初版创建
*
******************************************************************************/
#ifndef SS_TM_H_
#define SS_TM_H_
/******************************************************************************
*    Header File Inclusion
******************************************************************************/
#include "Common.h"
/******************************************************************************
*    Macro Definition
******************************************************************************/
#define SSTM_BASE_TIMESTAMP_1970_BJT    28800U    /* 1970年1月1日0时0分0秒对应的北京时间时间戳偏移(28800秒 = 8小时) */

/******************************************************************************
*    Enum Definition
******************************************************************************/


/******************************************************************************
*    Typedef Definition
******************************************************************************/


/******************************************************************************
*    Global variables Declaration
******************************************************************************/



/******************************************************************************
*    Global Function Prototypes
******************************************************************************/
void SSTM_SynTimeBySecTimeStamp(uint32_t neWSecTimeStamp);
void SSTM_SynTimeByDateTime(CommonDateTime_Struct *pTime);
void SSTM_MainFunction(void);
void SSTM_InitMemory(void);
uint32_t SSTM_GetSecTimestamp(void);
uint64_t SSTM_GetMsecTimestamp(void);
uint8_t SSTM_GetSyncTimeFlag(void);
void SSTM_GetDateTime(CommonDateTime_Struct *pTime);
void SSTM_GetTimeStr(char *pTimeStr);
#endif





















