/******************************************************************************
* File Name          : Asw_IotProtoAPRecv.h
* Description        : 安培协议接收帧解析头文件
* -------------------------------------------------------------------------------
* (c) This software is the proprietary of Bull. All rights are reserved by Bull.
-------------------------------------------------------------------------------
*             R E V I S I O N   H I S T O R Y
-------------------------------------------------------------------------------
* Date          Version      Author    Description
*------------    --------     -------   ----------------------------------------
*2026/05/21     V1.0.0       WDY        初版创建
*
******************************************************************************/
#ifndef ASW_IOT_PROTO_AP_RECV_H_
#define ASW_IOT_PROTO_AP_RECV_H_

/******************************************************************************
*    Header File Inclusion
******************************************************************************/
#include "Common.h"
#include "Asw_IotProtoAPTypes.h"

/******************************************************************************
*    Macro Definition
*******************************************************************************/


/******************************************************************************
*    Global Function Prototypes
******************************************************************************/

/* 接收帧解析控制表(外部仅通过此表间接访问各解析函数) */
extern const IotAPRecvCtrl_Struct c_stIotAPRecvctrlTable[IOT_AP_CMD_RECV_COUNT];

void IotAP_TimeoutDetect(void);

/* 以下为暂不实现的帧(直流桩/交流不开发) */

/* 白名单 - 暂不实现 */

#endif /* ASW_IOT_PROTO_AP_RECV_H_ */
