/******************************************************************************
* File Name          : Cdd_Drv_BL0942.h
* Description        : Code for Code for the device driver for BL0942
 ------------------------------------------------------------------------------
* (c) This software is the proprietary of Bull. All rights are reserved by Bull.
-------------------------------------------------------------------------------
*             R E V I S I O N   H I S T O R Y
-------------------------------------------------------------------------------
* Date          Version      Author    Description
------------    --------     -------   ----------------------------------------
*2025/10/10      V1.0.0      chenls    初版创建
*
******************************************************************************/
#ifndef CDD_DRV_BL0942_H_
#define CDD_DRV_BL0942_H_


/******************************************************************************
*    Include
******************************************************************************/
#include "Common.h"

/******************************************************************************
*    Macro Definition
******************************************************************************/
/* 寄存器地址 */
#define CDDDRV_BL0942_REG_I_RMS                    (0x03U)  /* 电流有效值寄存器，无符号 */
#define CDDDRV_BL0942_REG_V_RMS                    (0x04U)  /* 电压有效值寄存器，无符号 */
#define CDDDRV_BL0942_REG_WATT                     (0x06U)  /* 有功功率寄存器，有符号 */
#define CDDDRV_BL0942_REG_CF_CNT                   (0x07U)  /* 有功电能脉冲计数寄存器，无符号 */
#define CDDDRV_BL0942_REG_MODE                     (0x19U)  /* 用户模式选择寄存器 */
#define CDDDRV_BL0942_REG_SOFT_RESET               (0x1CU)  /* 软件复位寄存器 */
#define CDDDRV_BL0942_REG_USR_WRPROT               (0x1DU)  /* 用户写保护设置寄存器 */
#define CDDDRV_BL0942_REG_ALL                      (0xAAU)  /* 全电参数 */

#define CDDDRV_BL0942_REG_I_CHGN                   (0x22U)  /* 电流通道增益调整寄存器，补码 */
#define CDDDRV_BL0942_REG_V_CHGN                   (0x23U)  /* 电压通道增益调整寄存器，补码 */
#define CDDDRV_BL0942_REG_PHCAL                    (0x21U)  /* 通道相位调整寄存器 */
#define CDDDRV_BL0942_REG_WATTOS                   (0x24U)  /* 功率小信号校正寄存器，补码 */
#define CDDDRV_BL0942_REG_WA_CREEP                 (0x14U)  /* 功率防潜动阈值 */
#define CDDDRV_BL0942_REG_WRPROT2                  (0x31U)  /* 写保护寄存器 */
/******************************************************************************
*    Enum Definition
******************************************************************************/

/******************************************************************************
*    Header File Inclusion
******************************************************************************/


/******************************************************************************
*    Macro Definition
******************************************************************************/


/******************************************************************************
*    Enum Definition
******************************************************************************/


/******************************************************************************
*    Typedef Definition
******************************************************************************/



/******************************************************************************
*    Global variables Declaration
******************************************************************************/



/******************************************************************************
*    Global Function Prototypes
******************************************************************************/
void CddDrvBL0942_InitMemory(void);
void CddDrvBL0942_MainFunction(void);
uint8_t CddDrvBL0942_GetReadyFlag(uint8_t port);
uint32_t CddDrvBL0942_GetPeriodEnergy(uint8_t port);
uint32_t CddDrvBL0942_GetPower(uint8_t port);
uint32_t CddDrvBL0942_GetRmsVoltage(uint8_t port);
uint32_t CddDrvBL0942_GetRmsCurrent(uint8_t port);
#endif





















