/******************************************************************************
* File Name          : Common.h
* Description        : Code for Common function
 ------------------------------------------------------------------------------
* (c) This software is the proprietary of Bull. All rights are reserved by Bull.
-------------------------------------------------------------------------------
*             R E V I S I O N   H I S T O R Y
-------------------------------------------------------------------------------
* Date          Version      Author    Description
------------    --------     -------   ----------------------------------------
*2025/10/10      V1.0.0      Chenls    初版创建
*
******************************************************************************/
#ifndef Filter_H_
#define Filter_H_
/******************************************************************************
*    Header File Inclusion
******************************************************************************/
#include "Common.h"

/******************************************************************************
*    Macro Definition
******************************************************************************/
#define FILTER_FIFO_IO_POINT_COUNT        (10U)     /* 对于IO的FIFO, 每个FIFO可存储的最大点数 */

#define FILTER_FIFO_IO_COUNT              (5U)      /* IO的FIFO的个数 */

#define FILTER_FIFO_ANALOG_POINT_COUNT    (10U)     /* 对于模拟量的FIFO, 每个FIFO可存储的最大点数 */

#define FILTER_FIFO_ANALOG_COUNT          (5U)      /* 模拟量的FIFO的个数 */



/******************************************************************************
*    Enum Definition
******************************************************************************/


/******************************************************************************
*    Typedef Definition
******************************************************************************/


/******************************************************************************
*    Global variables Declaration
******************************************************************************/


/******************************************************************************
*    Global Function Prototypes
******************************************************************************/
GlobalRet_Enum Filter_IO_CreatFIFO(uint8_t *pIOFilterID, uint8_t pointCount, uint8_t initVal);
GlobalRet_Enum Filter_IO_InsertFIFO(uint8_t ioFilterID, uint8_t ioVal);
GlobalRet_Enum Filter_IO_GetVal(uint8_t ioFilterID, uint8_t *pIoVal);




#endif /* Filter_H_ */






















